ERP.belugaerp/src/Enums/бг_СостоянияПодакцизногоСырья/бг_СостоянияПодакцизногоСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СостоянияПодакцизногоСырья</name>
  <enumValues>
    <name>ВМестахХранения</name>
  </enumValues>
  <enumValues>
    <name>ВГотовойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВСпиртосодержащейСмеси</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантии</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЭкспортКромеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗСверхНормы</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортГарантии</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭСГарантии</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СостоянияПодакцизногоСырья/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СостоянияСырьяВРеализованнойПродукции() Экспорт
	СостоянияСырья = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВРеализованнойПродукцииРФ());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВОжиданииПодтвержденияЭкспорта());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СостоянияСырья, СостоянияСырьяВРеализованнойПродукцииПодтвержденоЭкспорт());
	
	Возврат СостоянияСырья;
КонецФункции

Функция СостоянияСырьяВРеализованнойПродукцииРФ() Экспорт
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВРеализованнойПродукции);
	
	Возврат СостоянияСырья;
КонецФункции

Функция СостоянияСырьяВРеализованнойПродукцииПодтвержденоЭкспорт() Экспорт
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспорт);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭС);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортГарантии);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ПодтвержденЭкспортЕАЭСГарантии);
	
	Возврат СостоянияСырья;
КонецФункции

Функция СостоянияСырьяВОжиданииПодтвержденияЭкспорта() Экспорт
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспорта);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаЕАЭС);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС);
	
	Возврат СостоянияСырья;
КонецФункции

Функция СостоянияСырьяВыполненоСписание() Экспорт
	СостоянияСырья = Новый Массив;
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме);
	СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗСверхНормы);
	
	Возврат СостоянияСырья;
КонецФункции

#КонецОбласти

#КонецЕсли
